docs/posts/2017-06-21-jekyll-ios-workflow.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 25, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Publishing to Jekyll with Editorial on iOS</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Publishing to Jekyll with Editorial on iOS</h1>
<p class="subtitle" role="doc-subtitle">Jun 21, 2017</p>
</header><p>
As a blog platform, Jekyll has a number of positive features: 
</p>

<ol class="org-ol">
<li>The speed and security of a static site,</li>
<li>The convenience and future-proofing of plain text, and most importantly for educators,</li>
<li>Free hosting on GitHub.</li>
</ol>

<p>
For me, the one drawback has been finding a convenient way to post using my iPad. There are a number of good Markdown editors for iOS, so writing posts is very easy, but publishing them can be a challenge.
 <a href="https://appsto.re/us/xONC1.i">Working Copy</a> works well to manage the Git repository, but it doesn&rsquo;t have the convenience that I wanted, and I really don&rsquo;t need to store my whole Jekyll repository on the iPad.
 I can post using <a href="https://appsto.re/us/PTVR2.i">Prompt 2</a> and my 
Linux server on <a href="https://www.digitalocean.com/">Digital Ocean</a>.  Neither of these are the simple write-and-post workflows that the iPad calls for, though.
</p>

<p>
Yesterday, I found this <a href="http://www.editorial-workflows.com/workflow/5838419494174720/XyeFJfsyXwE">workflow</a> by Max Jacobson. The first time it is run, it takes you to GitHub to generate an access token. After giving it the access token, the workflow will generate a file name in the correct format, prepare a commit message, and push the post to GitHub.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
</p>

<p>
Now, I&rsquo;m one step closer to being able to use the iPad as a desktop replacement.
</p>
<div id="footnotes">
<h2 class="footnotes">Footnotes</h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
I did have to slightly modify the workflow by changing the &ldquo;Request commit message from user&rdquo; step to require a single line entry.
</p></div></div>


</div>
</div></main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 25, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
